CASE_base/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interEHD;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         0.04;

deltaT          1e-10;

writeControl    adjustable;

writeInterval   0.001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1.0;

maxAlphaCo      0.1;

maxDeltaT       1;

functions
{
	#include "include/sampling.probes"
	#include "include/sampling.sets"
	#include "include/sampling.surfaces"
	//#include "include/residuals"
	#include "include/extractDroplets"
	#include "include/ecurrent"
}


// ************************************************************************* //
