CASE_base/system/include/extractDroplets
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      extractDroplets;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

extractEulerianParticles1
{
    type            extractEulerianParticles;
    libs            (fieldFunctionObjects);

    faceZone        collector1;
    alpha           alpha.water;

    alphaThreshold  0.1;

    enabled         true;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;
    writeInterval   1;
}

extractEulerianParticles2
{
    type            extractEulerianParticles;
    libs            (fieldFunctionObjects);

    faceZone        collector2;
    alpha           alpha.water;

    alphaThreshold  0.1;

    enabled         true;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;
    writeInterval   1;
}


// ************************************************************************* //
